/*******************************************************************************
 * file:	Safety.h
 * author:	A.Vlashchuk
 * version:	V1.0.0
 * date:	25-December-2015
 * brief:	Хедер для Safety.c
 *******************************************************************************/
#ifndef __SAFETY_H
#define __SAFETY_H

#include "STM32f4xx.h"
//---------------------------------------------------------------------------
// Прямое вычисление CRC16: ucBuf - буфер, wNBuf - число байт (без CRC)
//---------------------------------------------------------------------------
uint16_t wCRC16d(uint8_t* ucBuf, uint16_t wNBuf);
//------------------------------------------------------------------------------
// Табличное вычисление CRC16: ucBuf - буфер, wNBuf - число байт (без CRC)
//------------------------------------------------------------------------------
uint16_t wCRC16t(uint8_t* ucBuf, uint16_t wNBuf);
//------------------------------------------------------------------------------
// Циклическая проверка CRC16 слова конфигурации. При несовпадении - зацикливание
//------------------------------------------------------------------------------
void CRC16t_CycleVerify(void);
//------------------------------------------------------------------------------
// Вычислить CRC32 диапазона памяти (не включает FinAddr, вкл. инициализацию)
//------------------------------------------------------------------------------
uint32_t CRC32_CalcStAddrToFinAddr(uint32_t* StAddr, uint32_t* FinAddr);
//------------------------------------------------------------------------------
// Циклическая проверка CRC32 кода программы. При несовпадении - зацикливание
//------------------------------------------------------------------------------
void CRC32_CycleVerify(void);
#endif /* __SAFETY_H */
